title: Web Shell Deployment Using Xcopy To IIS Webroot
id: 9a4d7e62-6d5c-43d7-93c1-100006000001
status: test
description: Detects xcopy.exe copying content into the IIS webroot path.
references:
    - https://attack.mitre.org/techniques/T1505/003/
author: Santiago Czifra Tordoya
date: 2026-04-25
tags:
    - attack.persistence
    - attack.t1505.003
logsource:
    product: windows
    category: process_creation
detection:
    selection_process:
        Image|endswith: '\xcopy.exe'
    selection_commandline:
        CommandLine|re: '(?i)xcopy.*inetpub.*wwwroot'
    condition: selection_process and selection_commandline
fields:
    - Image
    - CommandLine
    - User
    - Computer
    - CurrentDirectory
    - ParentImage
    - ParentCommandLine
    - ProcessId
    - ParentProcessId
level: critical
